gcmAPI/Models/LTL/XMLFile3.xml

<?xml version='1.0' encoding='utf-8'?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header/>
  <soapenv:Body>
    <rat:rateQuote xmlns:rat="http://ws.estesexpress.com/schema/2017/07/ratequote">
      <rat:requestID> </rat:requestID>
      <rat:quote>
        <rat:quoteNumber>L3ZB4SS</rat:quoteNumber>
        <rat:account>8952735</rat:account>
        <rat:originPoint>
          <rat:countryCode>US</rat:countryCode>
          <rat:postalCode>30024</rat:postalCode>
          <rat:city>SUWANEE</rat:city>
          <rat:stateProvince>GA</rat:stateProvince>
        </rat:originPoint>
        <rat:destinationPoint>
          <rat:countryCode>US</rat:countryCode>
          <rat:postalCode>33144</rat:postalCode>
          <rat:city>MIAMI</rat:city>
          <rat:stateProvince>FL</rat:stateProvince>
        </rat:destinationPoint>
        <rat:payor>S</rat:payor>
        <rat:shipmentTerms>P</rat:shipmentTerms>
        <rat:pickup>
          <rat:date>2020-08-11</rat:date>
        </rat:pickup>
        <rat:liability>1</rat:liability>
        <rat:declaredValue>100.0</rat:declaredValue>
        <rat:stackable>Y</rat:stackable>
        <rat:lane>2</rat:lane>
        <rat:disclaimer>
          <rat:text> GUARANTEED SERVICES &amp;mdash; IMPORTANT NOTICES  All time-critical quotes expire at 3:00 p.m. today. Shipments must be tendered prior to 3:00 p.m. at the shipping location on the day of pickup to ensure pick up by 5:00 p.m.</rat:text>
          <rat:text>If your shipment consumes over 12 linear feet of trailer space OR exceeds 10,000 pounds, the shipment WILL incur additional surcharges to the Guaranteed LTL rate displayed. If your shipment may exceed these limits, please make sure you are logged into My Estes and choose the Volume and Truckload or Time Critical quote type, which require dimensions, when requesting a Rate Quote. If more convenient, you may contact the time critical guaranteed department for rates involving volume and over-length freight. Call 800-645-3952 or email timecritical@estes-express.com.</rat:text>
          <rat:text>Exclusive Use shipment rates are based on the availability of the specific vehicle type quoted at the time of the order confirmation. You will be contacted by the Time Critical department with confirmation when truck is secured.</rat:text>
          <rat:text> ADDITIONAL LTL SHIPMENT IMPORTANT NOTICES  The National Motor Freight Classification governs all freight classification disputes and is the sole source for determining actual classes. On collect shipments, if the consignee has a pricing program with Estes Express Lines, the consignee pricing prevails. Rates provided are only applicable to LTL shipments serviced by Estes Express Lines. Automated rate quotes are not applicable to service provided by other Estes operating entities.</rat:text>
          <rat:text>Unless otherwise provided, any LTL shipment that exceeds 350 cubic feet of a trailer will be subject to a minimum charge based on 6 pounds per cubic foot, at the customer's applicable class 125 rate and using the customer's discount. Please refer to EXLA 105 series tariff, Item 615 for complete information.</rat:text>
          <rat:text>Additional charges may apply to shipments to or from Cape Cod, Massachusetts; Harbor points in the state of Washington; remote areas of northern Canada; remote areas of Montana, Nevada, Oregon, Utah, and the Eastern Sierra of California. Please refer to EXLA 105 series tariff Items 290 through 299 for a complete list of points and applicable charges.</rat:text>
          <rat:text>All quotes are estimates based on the information provided by the requesting party. Actual tariffs and contracts on file at Estes Express Lines and in place at the time of shipment prevail. Unless otherwise provided, rules and service charges provided in EXLA 105 series tariff are applicable.</rat:text>
          <rat:text>*Transit times apply to standard Estes LTL shipments and are based on the actual date and time of the pickup, which may be different from the shipment date entered. Travel times for specialty services and custom solutions provided by other Estes operating entities may differ based on service selected. </rat:text>
          <rat:text> Full Value Cargo Liability Coverage Estes will provide a quote for Full Value Cargo Liability Coverage on all spot quotes when the customer selects this option on the rate quote application. By selecting this option, the customer will receive a conditional estimate of the Full Value Cargo Liability Coverage to be included in their volume quote. However, unless the customer's Bill of Lading also indicates the full value coverage amount in the appropriate section, the freight will not be covered at this value.</rat:text>
          <rat:text>VOLUME AND TRUCKLOAD: Notice to Shipper/Customer Customer is required to note Estes' quote number and selected V/TL service level (V/TL Basic, V/TL Guaranteed Economy or V/TL Guaranteed Standard) on the Bill of Lading at time of pickup. Customer certifies shipment information is accurately stated above. Only accessorial charges noted above are included in this rate. V/TL Basic quotes expire 30 days from the date received. V/TL Guaranteed Economy and V/TL Guaranteed Standard quotes expire at 3:00 p.m. local time on the date the quote is issued.  Terms and Conditions Estes' liability under the provisions of this quote shall not exceed $2.00 per lb./per article for new product or equipment and $0.10 per lb./per article for anything used or new and uncrated. Subject to maximum liability of $10,000 per trailer. Addit</rat:text>
          <rat:text>ional coverage may be purchased upon request.  Full Value Cargo Liability Coverage Estes will provide a quote for Full Value Cargo Liability Coverage on all spot quotes when the customer selects this option on the rate quote application. By selecting this option, the customer will receive a conditional estimate of the Full Value Cargo Liability Coverage to be included in their volume quote. However, unless the customer's Bill of Lading also indicates the full value coverage amount in the appropriate section, the freight will not be covered at this value.  Charges IF CUSTOMER HAS AN EXISTING CONTRACT OR TARIFF PUBLICATION, THIS SPOT QUOTE BECOMES NULL &amp; VOID AND THE CONTRACT/PUBLISHED RATE APPLIES.  This quote does not imply exclusive use, guaranteed serviceor equipment availability.   Rate is based on S</rat:text>
          <rat:text>hipper load/Consignee unload, no-touch freight.   Customer agrees to pay charges within 30 days of invoice. If charges are not paid in accordance with this agreement and collection efforts are necessary, this Spot Quote becomes void, and the charge reverts to your Estes LTL Pricing Program. If you do not have a current LTL Pricing Program, you will be charged according to Estes 720 LTL Tariff.  Customer is granted 1 hour free of charge for pickup and delivery. Additional time will be billed at $80.00 per hour.  Volume and Truckload Basic shipments are not subject to standard LTL transit times.  LTL tariff/contract discounts do not apply to Volume and Truckload quotes.  LTL tariff/contract discounted accessorials do not apply to Volume and Truckload shipments. </rat:text>
          <rat:text>EXLA 105 series tariff mandates accessorial charges.  Note regarding Truckloads - If "Piece Type" selected is Truckload, rate provided is for one full 53' trailer only, regardless of quantity listed in "Pieces" field.  Additional commodity lines are also ignored when any line uses Truckload in the Piece Type.  If actual shipment requires additional services not noted on this Spot Quote, Customer will be charged for additional service based on EXLA 105 series tariff. (A copy of the EXLA 105 series tariff is available at https://www.estes-express.com/resources/fees-and-surcharges/rules-tariff or by calling 804-353-1900, Ext. 2300.)</rat:text>
        </rat:disclaimer>
        <rat:commodityInfo>
          <rat:commodity>
            <rat:class>250.0</rat:class>
            <rat:weight>600</rat:weight>
            <rat:rate>191.21</rat:rate>
            <rat:charge>1147.26</rat:charge>
          </rat:commodity>
        </rat:commodityInfo>
        <rat:pricing>
          <rat:price>
            <rat:deliveryDate>2020-08-13</rat:deliveryDate>
            <rat:deliveryTime>17:00:00.000</rat:deliveryTime>
            <rat:serviceLevel>LTL Standard Transit</rat:serviceLevel>
            <rat:discount>0.75</rat:discount>
            <rat:totalDiscount>860.45</rat:totalDiscount>
            <rat:standardPrice>401.18</rat:standardPrice>
            <rat:accessorialInfo>
              <rat:accessorial>
                <rat:code>FSC</rat:code>
                <rat:description>Fuel Surcharge</rat:description>
                <rat:charge>59.37</rat:charge>
              </rat:accessorial>
            </rat:accessorialInfo>
          </rat:price>
        </rat:pricing>
      </rat:quote>
    </rat:rateQuote>
  </soapenv:Body>
</soapenv:Envelope>